cf_billing/AccumulationRegisters/энргВзаиморасчетыПоПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоПени</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерфейса_ПолучениеДанных

Функция ОстаткиНаГраницу(МВТ, Знач ТаблицаДляПомещения, Знач Организация, Знач Район, Знач Период = '0001-01-01', Знач МКД = Неопределено, Абонент = Неопределено) Экспорт	
	
	СоотвествиеПолей = Новый Структура("Организация,Район", "Организация","Район");
	ПараметрыЗапроса = Новый Структура("Организация,Район", Организация, Район); 	
	
	Если НЕ МКД = Неопределено Тогда
		СоотвествиеПолей.Вставить("МКД", "МКД");
		ПараметрыЗапроса.Вставить("МКД", МКД);
	КонецЕсли;
	
	Если НЕ Абонент = Неопределено Тогда
		СоотвествиеПолей.Вставить("Абонент", "Абонент");
		ПараметрыЗапроса.Вставить("Абонент", Абонент);
	КонецЕсли;	
	
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	
	ПараметрПериод = энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период");
	ПараметрыЗапроса.Вставить("Период",Период);
	ПараметрыСхемы = Новый Структура("ПараметрыВТ,Период", ПараметрыВТ, ПараметрПериод);
	
	Схема = Неопределено;
	ЗаполнитьСхемуЗадолженностьНаМоментВремени(Схема, ПараметрыСхемы, ТаблицаДляПомещения);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ); 	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ОборотыЗаПериод(МВТ, Знач ТаблицаДляПомещения, Знач Организация, Знач Район, Знач НачалоПериода = '0001-01-01', Знач КонецПериода = '0001-01-01', Знач МКД = Неопределено, Знач Абонент = Неопределено) Экспорт 
	
	СоотвествиеПолей = Новый Структура("Организация,Район", "Организация", "Район");
	ПараметрыЗапроса = Новый Структура("Организация,Район", Организация, Район); 	
	
	Если НЕ МКД = Неопределено Тогда
		СоотвествиеПолей.Вставить("МКД", "МКД");
		ПараметрыЗапроса.Вставить("МКД", МКД);
	КонецЕсли;	
	
	Если НЕ Абонент = Неопределено Тогда
		СоотвествиеПолей.Вставить("Абонент", "Абонент");
		ПараметрыЗапроса.Вставить("Абонент", Абонент);
	КонецЕсли;	
	ПараметрыВТ = Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
	ПараметрНачалоПериода	= энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериода");
	ПараметрКонецПериода	= энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериода");
	ПараметрыЗапроса.Вставить("НачалоПериода",	НачалоПериода);
	ПараметрыЗапроса.Вставить("КонецПериода",	КонецПериода);
	
	ПараметрыСхемы 	= Новый Структура("ПараметрыВТ,НачалоПериода,КонецПериода", ПараметрыВТ, ПараметрНачалоПериода, ПараметрКонецПериода);
	Схема  			= Неопределено;
	ЗаполнитьСхемуОборотыВзаиморасчетов(Схема, ПараметрыСхемы, ТаблицаДляПомещения);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса, МВТ); 	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ЗаполнитьСхемуЗадолженностьНаМоментВремени(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗадолженностьНаМоментВремени());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("Период") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["Период"].ИмяПараметра));
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Операторы[0].Отбор;
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,ПериодРасчета,Поставщик";
		ПараметрИсточника 	= ПараметрыИсточника[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСхемуОборотыВзаиморасчетов(Схема, ПараметрыСхемы, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  	= Новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаОборотыВзаиморасчетов());
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	
	Операторы = Пакет.Операторы;
	ПараметрыИсточника = Операторы[0].Источники[0].Источник.Параметры;
	
	Если ПараметрыСхемы.Свойство("НачалоПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["НачалоПериода"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыСхемы.Свойство("КонецПериода") Тогда
		ПараметрПериод 				= ПараметрыИсточника[1];
		ПараметрПериод.Выражение	= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1", ПараметрыСхемы["КонецПериода"].ИмяПараметра));		
	КонецЕсли;
			
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ОтборПакета 		= Пакет.Операторы[0].Отбор;
		ДоступныеПоляОтбора = "Организация,Район,МКД,Абонент,Услуга,ПериодНачисления,ПериодРасчета,Поставщик";
		ПараметрИсточника 	= ПараметрыИсточника[3];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрИсточника, ПараметрыСхемы.ПараметрыВТ, ДоступныеПоляОтбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовПолученияДанных

Функция ТекстЗапросаЗадолженностьНаМоментВремени()
	Текст  = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоПениОстатки.Организация КАК Организация,
	|	ВзаиморасчетыПоПениОстатки.Район КАК Район,
	|	ВзаиморасчетыПоПениОстатки.МКД КАК МКД,
	|	ВзаиморасчетыПоПениОстатки.Абонент КАК Абонент,
	|	ВзаиморасчетыПоПениОстатки.Услуга КАК Услуга,
	|	ВзаиморасчетыПоПениОстатки.ПериодНачисления КАК ПериодНачисления,
	|	ВзаиморасчетыПоПениОстатки.ПериодРасчета КАК ПериодРасчета,
	|	ВзаиморасчетыПоПениОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Остатки КАК ВзаиморасчетыПоПениОстатки";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаОборотыВзаиморасчетов()	
	Текст  =
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоПениОбороты.Период КАК Период,
	|	ВзаиморасчетыПоПениОбороты.Регистратор КАК Регистратор,
	|	ВзаиморасчетыПоПениОбороты.Организация КАК Организация,
	|	ВзаиморасчетыПоПениОбороты.Район КАК Район,
	|	ВзаиморасчетыПоПениОбороты.МКД КАК МКД,
	|	ВзаиморасчетыПоПениОбороты.Абонент КАК Абонент,
	|	ВзаиморасчетыПоПениОбороты.Услуга КАК Услуга,
	|	ВзаиморасчетыПоПениОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ВзаиморасчетыПоПениОбороты.ПериодРасчета КАК ПериодРасчета,
	|	ВзаиморасчетыПоПениОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоПени.Обороты(, , Регистратор, ) КАК ВзаиморасчетыПоПениОбороты";
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#КонецЕсли
